eisup_2019_docmng_integration/src/InformationRegisters/kwr_УстановкаДатыСФ/kwr_УстановкаДатыСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>kwr_УстановкаДатыСФ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БратьИзПоляДатаСФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/kwr_УстановкаДатыСФ/ManagerModule.bsl
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Агапов Н.А. Заявка №34379 21.09.2015 начало
Функция ПроверкаДаты(ДатаСФ,Организация) экспорт
	   Значение = ложь;
	
	   Запрос = Новый запрос;
	   Запрос.Текст =
	   "ВЫБРАТЬ
	   |	kwr_УстановкаДатыСФСрезПоследних.ДатаНачала
	   |ИЗ
	   |	РегистрСведений.kwr_УстановкаДатыСФ.СрезПоследних КАК kwr_УстановкаДатыСФСрезПоследних
	   |ГДЕ
	   |	kwr_УстановкаДатыСФСрезПоследних.БратьИзПоляДатаСФ = ИСТИНА
	   |	И kwr_УстановкаДатыСФСрезПоследних.Организация = &Организация";
	   запрос.УстановитьПараметр("Организация",Организация);
	   выборка = запрос.Выполнить().Выбрать();
	   
	   Пока выборка.Следующий() цикл
		   // {{KM WARE Малыгин П.К. Заявка 7717417 № 01.02.2016 начало
		   // Доработка алгоритма по заявке
		   // {{Старый код:
		   //		 Если выборка.ДатаНачала > ДатаСФ тогда
		   // }}Новый код:
		   Если ДатаСФ > выборка.ДатаНачала   тогда
			   // }}KM WARE Малыгин П.К. Заявка 7717417 № 01.02.2016 окончание   //
			   Значение = истина;	   
		   КонецЕсли;
	   КонецЦикла;
	   
	   возврат Значение;
	   
КонецФункции // ПроверкаДаты() }}KM WARE Агапов Н.А. Заявка №34379 21.09.2015 окончание
